
## Plan Result

[CI link](https://github.com/goda6565/portfolio/actions/runs/15128647885)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository
  * module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger
* Delete
  * module.cloudbuild_frontend_trigger.google_cloudbuildv2_repository.github_repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository will be created
  + resource "google_cloudbuildv2_repository" "github_repository" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + etag                  = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + name                  = "portfolio"
      + parent_connection     = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection"
      + project               = "portfolio-460206"
      + remote_uri            = "https://github.com/goda6565/portfolio.git"
      + update_time           = (known after apply)
    }

  # module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for frontend"
      + filename           = "manifests/cloudbuild/frontend.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/frontend/**",
        ]
      + location           = "us-west2"
      + name               = "frontend-trigger"
      + project            = "portfolio-460206"
      + service_account    = "projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + github {
          + name  = "portfolio"
          + owner = "goda6565"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

  # module.cloudbuild_frontend_trigger.google_cloudbuildv2_repository.github_repository will be destroyed
  # (because google_cloudbuildv2_repository.github_repository is not in configuration)
  - resource "google_cloudbuildv2_repository" "github_repository" {
      - annotations           = {} -> null
      - create_time           = "2025-05-19T00:55:34.269063874Z" -> null
      - effective_annotations = {} -> null
      - etag                  = "DU2Cr4gSXIxpqzfiTxaAgkzWrpjCnsOKwO6E5PODMrw" -> null
      - id                    = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection/repositories/portfolio" -> null
      - location              = "asia-northeast1" -> null
      - name                  = "portfolio" -> null
      - parent_connection     = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection" -> null
      - project               = "portfolio-460206" -> null
      - remote_uri            = "https://github.com/goda6565/portfolio.git" -> null
      - update_time           = "2025-05-19T00:55:35.749770027Z" -> null
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




## :warning: Errors

* add a label destroy: POST https://api.github.com/repos/goda6565/portfolio/issues/27/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":27,"Program":"tfcmt","SHA1":"0c1a957a72e8c5b56daee08b9471bddf9d7f8b8c","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->